[
  {
    "Opportunity Name": "RD Application Sustainment Operations & Maintenance Support",
    "Type": "Solicitation",
    "Agency": "Rural Housing Service (USDA)",
    "Due Date": "2025-06-02 19:00:00+00:00",
    "Set-Aside": "Competitive 8(a)",
    "NAICS": "541511 - Custom Computer Programming Services",
    "Location": "Washington, DC 20250, USA",
    "Summary": "This is a combined synopsis/solicitation for commercial services prepared in accordance with the format in subpart 12.6, as supplemented with additional information included in this notice. This announcement constitutes the only solicitation; proposals are being requested. This solicitation is issued as a Request for Proposal (RFP). The solicitation document and incorporated provisions and clauses are those in effect through Federal Acquisition Circular 2025-03. This solicitation is 100% set-aside for an 8(a) Small Business. The associated NAICS code is 541511 and the Small Business Size Standard is $34M. The USDA Rural Development Technology Office (TO) is responsible for developing, maintaining, and operating a portfolio of IT systems in support of RD's core programs. These programs provide financial assistance in the form of guaranteed and direct loans and grants.  RD requires the services of a qualified Offeror to provide support for four Focus Areas: 1) Production Support Operations (PSO), 2) Sustainment Engineering (SE) Salesforce Application O&M, 3) Sustainment Engineering (SE) “Legacy” Application O&M, 4) Development, Modernization, and Enhancements (DME). The Government intends to award a single award Indefinite Delivery Indefinite Quantity (IDIQ) contract resulting from this solicitation to the responsible Offeror whose proposal conforming to the solicitation will be most advantageous to the Government, price and other factors considered. The resulting IDIQ contract will include a 3-year ordering period with a 6-month option to extend services.",
    "SAM.gov Link": "https://sam.gov/opp/1f0a17f88ddb40be92e18543ebcb6f91/view",
    "Score": 5,
    "AI Recommendation": "Pursue Now"
  },
  {
    "Opportunity Name": "Real-World Application for Innovation and Development (RAPID)",
    "Type": "Pre-Solicitation",
    "Agency": "FDA Office of Acquisition and Grant Services (HHS - FDA)",
    "Due Date": "2025-05-27 16:00:00+00:00",
    "Set-Aside": "Total Small Business",
    "NAICS": "541512 - Computer Systems Design Services",
    "Location": "North Bethesda, MD, USA",
    "Summary": "The U.S. Food and Drug Administration (FDA) is issuing this source sought notice as a means of conducting market research, pursuant to FAR Part 10 Market Research, to identify viable industry parties capable of supporting FDA’s Real-World Application for Innovation and Development (RAPID), enhancement of the current AWS platform, development of new applications prototypes and Proof of Concepts. The mission of CDER’s Office of Computational Science (OCS) is to modernize the Center’s regulatory review process and enable reviewers to spend less time dealing with complex data and more time applying their expertise to information through the use of integrated tools, services, and training. OCS’ efforts to accomplish this mission involve developing technology and analytics to support regulatory review work. RAPID was developed as a means to implement a cloud-based and on-premises environment to develop and continuously improve the applications and databases needed to meet the innovation and analytical needs of FDA users. The RAPID platform is capable of supporting a variety of cloud and other operations including, supporting individual regulatory research, ingest, evaluate, and validate new analytic tools and methodologies, support new methods of multi data base curation, characterization and integration for transdisciplinary analysis of complex and big data, and a range of artificial intelligence tools and use cases for FDA needs. RAPID is a sandbox that promotes the development of innovative analytic tools, supports data science research, and the evaluation of cutting-edge technologies. The RAPID System in its current form uses Artificial Intelligence (AI) and cloud-based compute facilities to develop innovative analytical solutions that support regulatory decision making and scientific analysis. Refer to the National Academies of Sciences “Convergence”, https://www.nae.edu/113283.aspx, report to get an understanding of what ”transdisciplinary FDA scientific need” must include.",
    "SAM.gov Link": "https://sam.gov/opp/9b774fe5467f40f6b3aabd8b7601f752/view",
    "Score": 3,
    "AI Recommendation": "Monitor"
  },
  {
    "Opportunity Name": "Enterprise Information Services IV",
    "Type": "Pre-Solicitation",
    "Agency": "Air Force Space Command (DOD - USAF)",
    "Due Date": "2025-05-16 06:00:00+00:00",
    "Set-Aside": "Total Small Business",
    "NAICS": "541511 - Custom Computer Programming Services",
    "Location": "CHEY MTN AFB, CO 80914, USA",
    "Summary": "THIS NOTICE IS ISSUED AS AN RFI ANNOUCEMENT FOR INFORMATION PURPOSES. This notice DOES NOT constitute a Request for Proposal (RFP), Request for Quotation (RFQ), Invitation for Bid (IFB), or solicitation, nor does it represent any commitment by the Government. Since this is an RFI announcement, no evaluation letters and/or results will be issued to the respondents. No reimbursement will be made for any costs associated with providing information in response to this announcement. No telephone calls will be accepted requesting a bid package or solicitation. A solicitation does not presently exist.  SpOC/SAIO will not accept or acknowledge emails over 5MB, brochures, samples, catalogs, and any other marketing solicitation information. All responses shall comply with the criteria established in this RFI to be considered for review. Purpose: The Government is performing market research to support acquisition strategy decisions as they relate to determining if a small business set aside is appropriate as well as the best execution method (order under an existing IDIQ, solicitation/award via sam.gov, GSA schedule, etc.). Therefore, we further invite offerors to provide a capability statement in response to this requirement. Prospective contractors shall be registered in the System for Award Management (SAM) prior to award of any Federal Government contract. Contractors are encouraged to obtain further information on SAM registration at the following website: https://sam.gov/. The professional services in the DRAFT PWS requires offerors to provide United States Space Force (USSF) Enterprise Information Services (EIS) support for SpOC SharePoint sites, EIS Training for HQ SpOC users, and Enterprise Task Management Software Solution (ETMS2) license management and team names/workflow support for USSF units. USSF is defined as US Space Force Field Commands and Centers: Space Operations Command (SpOC); Space Systems Command (SSC); and Space Training and Readiness Command (STARCOM) and their units. EIS is defined as collaboration tools e.g., SharePoint, MS Power Platform (Apps/BI), ETMS2, and MS Teams. All performance shall be in accordance with this Performance Work Statement (PWS). Industry Response: All responses shall be received by Friday, May 16, 2025 @ 12:00 PM Mountain Time. No extension to the response date will be considered.  Send responses via e-mail to Ms. Kerri Kramer, kerri.kramer@spaceforce.mil. Responses shall be no more than 10 pages (single spaced, front and back, no smaller than Times New Roman, font size 12 or equivalent). If submissions exceed the page count noted, the Government reserves the right to only review the first 10 pages and may disregard the remainder of the submission.  Extraneous materials (brochures, manuals, etc.) will not be considered. Questions Please provide the following information in your response in order for the Government to thoroughly evaluate your response and assist in executing the purposes of this RFI:   Name, address, point of contact (telephone number and email address), CAGE Code, and UEI.   Does your firm currently provide these services under an existing contract such as an Indefinite Delivery Indefinite Quantity (IDIQ) or Government-Wide Acquisition Contract? If so, please provide the contract number, point of contact name/number, and managing agency (e.g., Air Force, DoD, GSA).    Specify your business type based upon NAICS 541511. Specify all that apply.  __ Large Business  __ Small Business  __ Small Disadvantaged Business (SDB)  __ 8(a)   __ HUBZone   __ Woman Owned Small Business (WOSB)  __ Veteran-Owned Small Business (VOSB)  __ Service-Disabled Veteran-Owned Small Business SDVOSB)  Is the NAICS 541511 code appropriate for this scope of work? If you determine it to be inappropriate, what NAICS code would be appropriate and why?    Would your organization propose on this project as a prime contractor, prime contractor with subcontractor(s), prime contractor with team member subcontractor(s), or a joint venture?  Identify the business size of your team members or joint venture firms.   If a teaming arrangement is planned, give details to the extent practicable on how the team will likely be composed. See FAR subpart 9.6 for Government policy on teaming arrangements and 8(a) Program regulations described in 13 CFR 124.513.   Identify any projects completed in the past five (5) years for the same or similar scope to help determine your firm’s capability and capacity in meeting the requirement for the services listed in the attached DRAFT PWS.    For the DRAFT PWS, interested offerors are encouraged to submit questions/feedback for Government review. The intent of obtaining questions/feedback on the PWS is to further assist industry when proposing on the PWS and to streamline the solicitation process. The Government will not post official responses to the questions/feedback but they will be reviewed by the Government. If questions/answers are provided the details will be shared to all respondents.",
    "SAM.gov Link": "https://sam.gov/opp/1c67fa9ae0e940aba2417d62e0cf3eb5/view",
    "Score": 3,
    "AI Recommendation": "Monitor"
  },
  {
    "Opportunity Name": "Cybersecurity Services RFI 2025",
    "Type": "Pre-Solicitation",
    "Agency": "ACC Aberdeen Proving Ground (DOD - Army - AMC - ACC)",
    "Due Date": "2025-05-16 21:00:00+00:00",
    "Set-Aside": "No Set-Aside Used",
    "NAICS": "541519 - Other Computer Related Services",
    "Location": "Aberdeen Proving Ground, MD 21005, USA",
    "Summary": "Introduction This is a Request for Information (RFI), as defined in Federal Acquisition Regulation (FAR) 15.201(e). Army Contracting Command - Aberdeen Proving Ground (ACC-APG), in support of the Program Manager (PM) Intelligence Systems and Analytics (IS&A) Aberdeen Proving Ground (APG), is conducting market research to services as defined in Section 2 below. The Government invites all types of businesses and academic organizations to respond to this RFI notice. This RFI is issued solely for information and planning purposes - it does not constitute a Request for Proposal (RFP) or a promise to issue an RFP in the future. The Government may request additional information in the future; there is no intent to proceed with a procurement. Solicitations are not available at this time. Requests for a solicitation will not receive a response. This notice does not constitute a commitment by the United States Government to contract for any supply or service whatsoever. This RFI is not an authorization to begin work, and the Government will not pay any costs that contractors may incur in response to this RFI. Contractors are not required to respond to this announcement but may do so at their own cost. The United States Government will not pay for information requested nor will it compensate any respondent for any cost incurred in developing information provided to the United States Government. Background PM IS&A fields a plethora of intelligence collection, processing, and dissemination systems to all Military Intelligence formation in the Army. All of these systems have requirements to be connected to a network, so they must achieve an Authority to Operate (ATO) from the proper Authorizing Official (AO), to include but not limited to DoD and Intelligence Community (IC) authorizations. This requires PM staff to closely collaborate with DA G-2 & PEO IEW&S to both achieve and maintain system authorizations for the entire life-cycle of a product. The government requires support with Risk Management Framework (RMF) oversight and cybersecurity engineering efforts to include design, implementation, fielding, and training of cross-domain solutions. White Paper and Supporting Documentation Responses to this RFI are due no later than 1700 EDT on 16 May 2025 and must address the following information requests listed below in a white paper format. The white paper shall not exceed 5 pages, not including cover sheet or cover letter. Section 1: Past Performance with Risk Management Framework (RMF) Provide a narrative on how you have supported the government in the past building RMF packages. Include mention of how controls were addressed, if automated tools such as eMASS, were used, and which organizations the packages were processed by (NETCOM, IC, and others). Also, discuss the networks for which the solutions were authorized. Section 2: Past Performance with Cross-Domain Solutions Describe past experience designing, configuring, implementing, testing, and securing cross-domain hardware and/or software. Include which networks were linked, and which organizations you worked with to achieve the authorization. Section 3: Key Resources Describe what kind of resources your company can bring to bear; such as unique skills or training and novel processes to achieve and monitor authorizations. Section 4: CLIN Structure/Contract Type(s) The government is open to flexible contract line item number (CLIN) structures to meet efficient and traceable performance. Please suggest how your vision of this requirement would be structured in regard to CLIN structure and cost tracking for base and option periods. Section 5: Facility and Security Clearance Requirements Does your company have a Top Secret facility clearance, either as a prime contractor or through subcontracting partnerships? Please explain. Is your company able to provide employees who are capable of obtaining a Top Secret/SCI clearance, either as a prime contractor or through subcontracting partnerships? Please explain. Section 6: Cybersecurity Personnel Qualifications Describe the cybersecurity personnel qualifications your company can bring to bear, specifically to meet DFAR 252.239.7001, DoDD 8140.01, DoD 8570.01-M and Army Regulation (AR 25-2) requirements. Privileged accounts require DoD 8570 IAT II and IAT III. Is your company able to provide personnel to meet DoD 8570 IAT II and IAT III, either as a prime contractor or through subcontracting partnerships? Please explain. Notes: This notice is part of Government Market Research, a continuous process for obtaining the latest information on the commercial status of the industry. This RFI is for planning purposes, and does not constitute a commitment, implied or otherwise, that a procurement action will follow. The Government will use the information submitted in response to this notice at its discretion and will not provide comments to any submission; however, the Government reserves the right to contact any respondent to this notice for the sole purpose of enhancing understanding of the notice submission. Information received will not be considered confidential/proprietary unless marked accordingly. Company proprietary data will be reviewed by Government employees and authorized representatives only. Responses to this notice are not offers and cannot be accepted by the Government to form a binding contract. Responders are solely responsible for all expenses associated with responding to this RFI, including any market research product demonstrations. Responses to this RFI must be submitted by 1700 EDT 16 May 2025. All interested parties shall respond in as clear manner as possible to each of the areas listed above. Information is preferred in soft-copy form in Microsoft Word/Excel and shall not exceed 5 pages. You may submit your responses via email address to: Subject Line: “Cybersecurity RFI 2025” Point of Contact:         nicholas.m.mitrocsak.civ@army.mil All information must be submitted in writing via email; telephone requests for additional information will not be honored. Acknowledgement of receipt will be issued. If you choose to submit proprietary information, mark it accordingly.",
    "SAM.gov Link": "https://sam.gov/opp/28825a784472457489c4c5e1af180705/view",
    "Score": 1,
    "AI Recommendation": "Skip"
  },
  {
    "Opportunity Name": "Integrated Defensive Cyberspace System (IDCS) Secure Platform Architecture for Real-Time Threat Analysis and Network Defense (SPARTAN)",
    "Type": "Pre-Solicitation",
    "Agency": "AFLCMC Joint Base San Antonio (DOD - USAF - AFMC - AFLCMC)",
    "Due Date": "2025-05-15 19:00:00+00:00",
    "Set-Aside": "No Set-Aside Used",
    "NAICS": "541512 - Computer Systems Design Services",
    "Location": "San Antonio, TX, USA",
    "Summary": "The Defensive Cyber Systems Branch (AFLCMC/HNCD) is actively seeking potential sources that have the expertise, capabilities, and experience required for the development, fielding, and sustainment of an enterprise wide systems-of-systems platform similar to the IDCS.  This complex and critical effort encompasses a broad array of tasks necessary for the protection and defense of the cyberspace domain pertaining to the Department of the Air Force.  AFLCMC/HNCD prioritizes vendors that demonstrate an ability to deliver outcomes promptly and adaptively, ensuring a fast flow of operational value augmented by persistent learning and maturation of supporting processes and team infrastructure. The primary objectives are to ensure: -Timely and secure delivery of software and system development for the Integrated Defensive Cyberspace System (IDCS) capable of meeting the evolving challenges in the cyber domain. -Efficient and effective fielding and sustainment processes for operational systems, such as Air Force Cyber Defense (ACD), Cyberspace Defense Analysis (CDA), and Cyberspace Vulnerability/Hunter (CVA/H). -Integration of a robust vendor base that can support AFLCMC/HNCD in prototyping and maturing the new IDCS architecture with a focus on modular, resilient, and cloud-based systems. -Collaboration with other Department of the Air Force programs, ensuring compatibility and interoperability with existing and future defense systems.",
    "SAM.gov Link": "https://sam.gov/opp/e581c2cb8d994e4b9497be255468175c/view",
    "Score": 1,
    "AI Recommendation": "Skip"
  }
]